Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # cloudflare_dns_record.dns_records["external"] will be created
+ resource "cloudflare_dns_record" "dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "external"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["@"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "@"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["atlantis"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "atlantis"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["grafana"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "grafana"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["hass"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "hass"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["n8n"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "n8n"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["overseerr"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "overseerr"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["plex"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "plex"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["prometheus"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "prometheus"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["prowlarr"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "prowlarr"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["radarr"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "radarr"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["sabnzbd"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sabnzbd"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_dns_record.tunnel_dns_records["sonarr"] will be created
+ resource "cloudflare_dns_record" "tunnel_dns_records" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "sonarr"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_zero_trust_access_application.atlantis will be created
+ resource "cloudflare_zero_trust_access_application" "atlantis" {
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "atlantis.fabricesemti.dev"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Atlantis"
      + path_cookie_attribute        = false
      + policies                     = (known after apply)
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = true
      + target_criteria              = (known after apply)
      + type                         = "self_hosted"
      + updated_at                   = (known after apply)
      + zone_id                      = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_zero_trust_access_application.hass will be created
+ resource "cloudflare_zero_trust_access_application" "hass" {
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "hass.fabricesemti.dev"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Home Assistant"
      + path_cookie_attribute        = false
      + policies                     = (known after apply)
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = true
      + target_criteria              = (known after apply)
      + type                         = "self_hosted"
      + updated_at                   = (known after apply)
      + zone_id                      = "d0c0fbdcd95438bc60860f16d45737db"
    }

  # cloudflare_zero_trust_access_policy.example_zero_trust_access_policy will be created
+ resource "cloudflare_zero_trust_access_policy" "example_zero_trust_access_policy" {
      + account_id                     = (sensitive value)
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "bypass"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + everyone = {}
            },
        ]
      + isolation_required             = false
      + name                           = "Application Bypass"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "30m"
      + updated_at                     = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.tunnel will be created
+ resource "cloudflare_zero_trust_tunnel_cloudflared" "tunnel" {
      + account_id        = (sensitive value)
      + account_tag       = (known after apply)
      + config_src        = "local"
      + connections       = (known after apply)
      + conns_active_at   = (known after apply)
      + conns_inactive_at = (known after apply)
      + created_at        = (known after apply)
      + deleted_at        = (known after apply)
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "terraformed-docker-tunnel"
      + remote_config     = (known after apply)
      + status            = (known after apply)
      + tun_type          = (known after apply)
      + tunnel_secret     = (sensitive value)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.tunnel_config will be created
+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "tunnel_config" {
      + account_id = (sensitive value)
      + config     = {
          + ingress        = [
              + {
                  + hostname       = "fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:11111"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "atlantis.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.21:4141"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "grafana.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:3000"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "hass.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.21:8123"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "n8n.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.21:5678"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "overseerr.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:5055"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "plex.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.2:32400"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "prometheus.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:9090"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "prowlarr.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:9696"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "radarr.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:7878"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "sabnzbd.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:18080"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + hostname       = "sonarr.fabricesemti.dev"
                  + origin_request = (known after apply)
                  + service        = "http://10.0.40.20:8989"
                    # (1 unchanged attribute hidden)
                },
              + {
                  + origin_request = (known after apply)
                  + service        = "http_status:404"
                    # (1 unchanged attribute hidden)
                },
            ]
          + origin_request = (known after apply)
          + warp_routing   = (known after apply)
        }
      + created_at = (known after apply)
      + id         = (known after apply)
      + source     = "local"
      + tunnel_id  = (known after apply)
      + version    = (known after apply)
    }

  # local_file.tunnel_config will be created
+ resource "local_file" "tunnel_config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/home/atlantis/.cloudflared/config.yaml"
      + id                   = (known after apply)
    }

  # local_file.tunnel_credentials will be created
+ resource "local_file" "tunnel_credentials" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # random_password.tunnel_secret will be created
+ resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ tunnel_config_content = (known after apply)
+ tunnel_id             = (known after apply)
+ tunnel_name           = "terraformed-docker-tunnel"

Warning: Resource Destruction Considerations

  with cloudflare_zero_trust_tunnel_cloudflared_config.tunnel_config,
  on main.tf line 158, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "tunnel_config":
 158: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "tunnel_config" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://6e812502408f:4141/lock?id=fabricesemti80%252Fhome-terraform-cloudflare%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 21 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
